# ConcreteBrightmode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Concrete..::..ConcreteBrightmode Property
Concrete Class See Also
---
The property labeled "Weathering" from the "Concrete" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string ConcreteBrightmode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConcreteBrightmode As String
	Get
```

Visual C++
---
```text
public:
static property String^ ConcreteBrightmode {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteBrightmodeType".
# See Also
Concrete Class
Autodesk.Revit.DB.Visual Namespace